# St7DisableNLAFreedomCase

Disables the specified freedom case such that it is not included in nonlinear static analysis.

long St7DisableNLAFreedomCase(long uID, long Stage, long CaseNum)
Input Parameters
uID
Strand7 model file ID.
Stage
Stage index – use 0 for unstaged analysis.

CaseNum
Freedom case number.